[
  {
    "title": "Public and Untrusted WiFi Networks",
    "date": "2025-04-08",
    "excerpt": "A practical breakdown of why public WiFi still carries risk even with HTTPS, and how to reduce exposure.",
    "url": "/blogs/post.html?post=public_wifi",
    "slug": "public_wifi",
    "source": "/blogs/public_wifi.md",
    "tags": [
      "Network Security",
      "Risk Management",
      "Privacy"
    ],
    "markdown": "## Public and Untrusted WiFi Networks\n\nPublic WiFi is convenient, but convenience often means reduced trust. Even with HTTPS everywhere, there are still privacy, interception, and misconfiguration risks that can expose users and organizations.\n\n![Public WiFi warning visual](/images/disclaimer.png)\n\n### Common risks on untrusted networks\n\n- **Evil twin access points:** attacker-controlled hotspots that mimic legitimate SSIDs.\n- **Traffic interception attempts:** DNS manipulation, captive portal abuse, and downgrade attempts.\n- **Device exposure:** accidental sharing services and stale local trust settings.\n- **Session hijacking opportunities:** especially with weakly protected web sessions.\n\n### Practical hardening steps (iOS and Android)\n\n1. **Prefer cellular data** for sensitive sessions.\n2. **Use a trusted VPN** when WiFi is unavoidable.\n3. **Disable auto-join** for unknown or open networks.\n4. **Use randomized/private MAC addresses** on every network.\n5. **Enable private DNS / encrypted DNS** where possible.\n6. **Keep OS and apps updated** to reduce exploitability.\n7. **Restrict app permissions** to minimum required access.\n8. **Avoid high-risk actions** (banking, corporate admin portals) on public WiFi.\n9. **Use MFA** for all critical accounts.\n10. **Turn off nearby sharing services** when not needed.\n\n### Defensive operating habits\n\n- Verify the hotspot name with staff before connecting.\n- Treat captive portals as untrusted input.\n- Log out after completing sessions.\n- Restart your device after disconnecting from risky networks.\n\n### Disclaimer\n\nThis material is educational and informational only. It is not legal advice and does not guarantee security outcomes. Always align controls with your organization’s policies and legal obligations.\n\n### References\n\n- https://www.fox5vegas.com/2024/08/08/las-vegas-police-issues-cyber-advisory-with-cybersecurity-hacker-conventions-town/\n- https://en.wikipedia.org/wiki/Kazakhstan_man-in-the-middle_attack"
  },
  {
    "title": "iPod Classic Flash Mod Rebuild",
    "date": "2025-01-15",
    "excerpt": "A professional-ish walkthrough of how I rebuilt an iPod Classic with flash storage and a higher-capacity battery using parts from Elite Obsolete.",
    "url": "/blogs/post.html?post=ipod_classic_flash_mod_rebuild",
    "slug": "ipod_classic_flash_mod_rebuild",
    "source": "/blogs/ipod_classic_flash_mod_rebuild.md",
    "tags": [
      "Hardware",
      "DIY",
      "Repair",
      "iPod",
      "Homelab"
    ],
    "markdown": "## Intro\n\nIn January 2025, I rebuilt a 5th-gen iPod Classic as a small “reliability upgrade” project for the battery and the storage. \n\n![Parts laid out before reassembly](/images/ipod-flash-mod-01-parts-laid-out.jpg)\n\nWith many services moving to a subscription model accessible via the cloud and an internet connection, it's difficult to maintain a library of music that is available whenever and wherever you wish. \n\nAdditionally, for those that wish to establish a reduction in their internet-connected/wireless footprint, you'll be hard pressed to find a reliable, internet(less) device with plenty of storage capacity that has a long enough battery charge to last through weekend trips. \n\nI say why reinvent the wheel. The iPod Classic was a revolution in its time, and with the right parts, you can supercharge certain aspects of iPod Classic. With a conversion board that takes a micro SD card, and a 3000 mAh battery, you can extend the life of this legacy technology. \n\nThe original battery hovers around 850 mAh, and the hard disk ranged from ~30 GB - ~80 GB. With a 128 GB micro SD card and the vast battery capacity increase, the improvement is rather insane.\n\n\"Done\" for me is ending up with a device that I can use for many days without charging and without running out of storage, and these upgrades fit the bill for me. \n\n## What I started with\n\nThe baseline was a black iPod Classic (5th gen) that still had the original hard drive.\n\n![Original hard drive (before removal)](/images/ipod-flash-mod-02-original-hard-drive.jpg)\n\nThe drive clicked, crashed, and wouldn't flash anyways. The upgrade was very necessary. Additionally, the original battery did not hold a charge. \n\nThe drive also was not snappy or fast, which shouldn't be surprising. It was worth my time diagnosing these issues, since they could've been used in other projects.\n\n## Parts I used\n\nThese were the parts that made the rebuild possible.\n\n- **Tarkan iFlash Solo (SD / microSD ZIF adapter)** — replaces the HDD with flash storage.\n- **Tarkan iFlash 40-pin ZIF HDD flex cable** — avoids fighting an old/brittle ribbon.\n- **3000mAh “thick” extended battery** — improves runtime and offsets flash mod “why not” energy.\n- **Kapton tape (ESD/heat resistant)** — insulation + strain relief where you *really* don’t want shorts.\n- **Red double-sided adhesive tape** — mounting the battery cleanly without rattles.\n\nIn order to fit the 3000 mAh battery within the new case, a foam block holding up the headphone assembly needed to be removed. The 3000 mAh was the approximate correct height (just as large as the foam block was tall), so this was not an issue. The double-sided tape held the battery firmly in place. Kapton ESD tape was used to cover the back and front of the iFlash Solo to prevent electrical shorts, which is possible, given the conductivity of the case and other components. \n\n## The build workflow\n\nThis is the high-level process I followed to keep it clean and repeatable.\n\n1. Open the clamshell with a knife blade and the separator.\n2. Disconnect the battery early so nothing is “live” while moving ribbons and boards around.\n3. Remove the original hard drive and set it aside.\n4. Install the iFlash Solo + replacement ZIF cable and confirm the connector is fully seated and aligned.\n5. Insulate and secure the adapter/cable path with Kapton so it can’t rub or pinch when closed.\n6. Install and mount the new battery using adhesive so it won’t shift inside the enclosure.\n7. Do a dry-fit close (no force) to confirm nothing is bulging or being crushed.\n8. Restore the firmware (reformat) and verify stable boot + sync before calling it done.\n\n![Plugging in the iFlash Solo adapter](/images/ipod-flash-mod-03-plugging-in-iflash-solo.jpg)\n\nConnecting the iFlash Solo with the ZIF cable is exceedinly difficult, given that the cable is held with pressure from the connector. It is important to verify that while connecting the ZIF cable, you make positive connections to the connectors, which isn't an exact \"the sky is blue\" feeling. \n\nIt is a subjective feeling that is only verified with intuition, as each connector and each iPod feels different, according to what I've read online from others' experiences. I can only make an educated guess as to why this is; whether or not the drive has been previously replaced before, and creates \"wear\", or otherwise. \n\n## Things that mattered more than I expected\n\nThese are the “small details” that keep the mod from turning into a troubleshooting session.\n\n- ZIF connector alignment is everything (crooked seating can look “connected” but fail later).\n- Cable routing matters because the iPod case will happily pinch anything in its way.\n- Insulation is not optional when you’ve got tight tolerances and exposed pads.\n- Battery thickness needs to match the backplate (thin vs thick) or closure becomes a problem.\n- Testing before final close saves the most time (boot, hold switch, clickwheel, audio, sync).\n\n## Result\n\nThe finished device boots cleanly and feels like a modernized version of the original, while maintaining the classic look.\n\n![iPod reassembled and powered on](/images/ipod-flash-mod-04-finished-powered-on.jpg)\n\nI noticed that my iPod lasts days instead of hours, has great sound quality for my requirements, and has plenty of storage."
  },
  {
    "title": "Obsidian Threat Heat Map",
    "date": "2024-12-09",
    "excerpt": "Using an Obsidian workflow to visualize incident relationships and identify recurring threat patterns.",
    "url": "/blogs/post.html?post=obsidian_threat_heat_map",
    "slug": "obsidian_threat_heat_map",
    "source": "/blogs/obsidian_threat_heat_map.md",
    "tags": [
      "Threat Modeling",
      "Obsidian",
      "SOC Workflow"
    ],
    "markdown": "## Obsidian Threat Heat Map\n\nHaving a repeatable way to track incidents is critical if you want to derive trends, improve triage, and predict risk over time. This workflow repurposes Obsidian graph features as a lightweight threat relationship map.\n\n> **No real incident data is used in this example.**\n> All data is fake and intentionally defanged.\n\n![A beautiful heatmap in Obsidian](/images/obsidian-heatmap.png)\n\n### 1) Defang your IOCs before anything else\n\nUse CyberChef (or equivalent) to neutralize indicators such as IPs, domains, URLs, and email addresses before storing or sharing.\n\n![Defanging fake IOCs](/images/cyberchef.png)\n\n### 2) Bulk-tag indicators to speed up linking\n\nAfter you prepare a list of IOCs in a text editor, wrap each IOC in Obsidian wiki-link syntax (`[[...]]`). This causes each IOC to become a linked object in the graph.\n\n![Performing mass text manipulation](/images/textmanipulation.png)\n\n### 3) Use a consistent incident template\n\nA consistent template prevents missing fields and keeps your graph meaningful as your data set grows.\n\n![Template incident report](/images/obsidiantemplate.png)\n\n### 4) Build relationships across incidents\n\nLoad your tagged IOCs into multiple incidents. Shared artifacts automatically create graph relationships.\n\n![Tagged and defanged IOCs loaded](/images/taggediocs.png)\n\nAs your case volume grows, linked artifacts make it easier to identify recurring campaigns, repeated targets, and hotspot clusters.\n\n![Observing links in graph view](/images/furtherlinks.png)\n\n### Why this helps\n\n- Visualizes incident overlap over time.\n- Highlights repeated attacker infrastructure.\n- Surfaces frequent target groups/departments.\n- Makes trend communication easier for leadership.\n\n### Closing thoughts\n\nThis is not a replacement for full-scale threat intelligence platforms. It is a practical and low-friction workflow for teams already using Obsidian that want better visibility with minimal overhead."
  }
]
